#### Terraform Format and Style 🖌`failure`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
data.aws_db_subnet_group.existing: Reading...
data.aws_vpc.existing: Reading...
data.aws_db_instance.existing: Reading...
data.aws_db_instance.existing: Read complete after 0s [id=fastfood-db]
data.aws_db_subnet_group.existing: Read complete after 0s [id=fastfood-rds-subnet-group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_policy.rds_read_write_policy will be created
  + resource "aws_iam_policy" "rds_read_write_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow read and write to RDS"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "fastfood-rds-read-write-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "rds:DescribeDBInstances",
                          + "rds:ListTagsForResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "rds-db:connect",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:rds-db:us-east-1:*:dbuser/postgres"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.rds_access_role will be created
  + resource "aws_iam_role" "rds_access_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "fastfood-rds-access-"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_rds_policy will be created
  + resource "aws_iam_role_policy_attachment" "attach_rds_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>